Revit 2016 API
ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropService Property
 The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static ExternalServiceId DuctFittingAndAccessoryPressureDropService { get; }
Visual Basic
Public Shared ReadOnly Property DuctFittingAndAccessoryPressureDropService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ DuctFittingAndAccessoryPressureDropService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace